---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient2Wall
source: html/70f2ca0e-24eb-c921-7c51-4392ac5c6042.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient2Wall Property

"Alternating Bar - End Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinEndHookOrient2Wall { get; }
```